Config/DataProcessors/ЗаполнениеРегистровОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеРегистровОС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/Documents/КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыОперацийДоходов</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаКомпенсацииРодительскойПлаты</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияОбщихЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.СведенияОбУдержанномНДФЛ</xr:Item>
				<xr:Item>AccumulationRegister.ИсполнениеДоговоровСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияБСО</xr:Item>
				<xr:Item>InformationRegister.СтавкиНалогаНаИмуществоПоОсновнымСредствам</xr:Item>
				<xr:Item>InformationRegister.КапРемонтОС</xr:Item>
				<xr:Item>AccumulationRegister.НаличныеДенежныеСредства</xr:Item>
				<xr:Item>InformationRegister.СоставыКомплектовМЗПТ</xr:Item>
				<xr:Item>InformationRegister.АмортизацияОС</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаОтПокупателейДебиторов</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеОС</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияФактическиеОбразование</xr:Item>
				<xr:Item>AccumulationRegister.РасходПродуктов</xr:Item>
				<xr:Item>AccumulationRegister.УчетКомпенсацииРодительскойПлаты</xr:Item>
				<xr:Item>InformationRegister.ПорядокОплатыОбразование</xr:Item>
				<xr:Item>AccumulationRegister.ИсходящийНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТоварыОтгруженныеВЕАЭС</xr:Item>
				<xr:Item>InformationRegister.ПланФинансированияОбязательств</xr:Item>
				<xr:Item>AccumulationRegister.КодыИСМПБГУ</xr:Item>
				<xr:Item>AccumulationRegister.БезналичныеДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.РезервМЗ</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрочихУслугахСтудентам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентами</xr:Item>
				<xr:Item>InformationRegister.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости</xr:Item>
				<xr:Item>AccumulationRegister.КнигаПокупок</xr:Item>
				<xr:Item>AccumulationRegister.КнигаПродаж</xr:Item>
				<xr:Item>InformationRegister.ПлательщикиПоДоговоруОбразование</xr:Item>
				<xr:Item>InformationRegister.СведенияОбОбъектеИмущества</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
				<xr:Item>InformationRegister.ОперацииСПрослеживаемымиТоварами</xr:Item>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиДетейСКорректировкой</xr:Item>
				<xr:Item>InformationRegister.СведенияОбОбъектахПравПользованияОС</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВТорговыхТочках</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаЛицевыхСчетах</xr:Item>
				<xr:Item>InformationRegister.ОплатаПоДоговорамПлатежногоАгента</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровНаКомиссии</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиДетей</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходовОСиНМА</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиРаздела7Декларации</xr:Item>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиСтудентов</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаОС</xr:Item>
				<xr:Item>InformationRegister.ДолгосрочныеПраваПользованияАктивами</xr:Item>
				<xr:Item>AccumulationRegister.ВходящийНДСКРаспределению</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСоСтудентамиДопУслуги</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ДолгосрочнаяПросроченнаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчетУСН</xr:Item>
				<xr:Item>AccumulationRegister.НаличиеДрагМатериаловВОбъектахНФА</xr:Item>
				<xr:Item>InformationRegister.СоставОбъектовПравПользованияОС</xr:Item>
				<xr:Item>InformationRegister.СрокиИсполненияИСуммыОбязательств</xr:Item>
				<xr:Item>AccumulationRegister.ГрафикАмортизацииПравПользованияОС</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТоварыКомитентов</xr:Item>
				<xr:Item>AccumulationRegister.ЗакупленныеТоварыКомитентов</xr:Item>
				<xr:Item>AccumulationRegister.РасходГСМ</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоставщикамКредиторам</xr:Item>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
				<xr:Item>AccumulationRegister.ЗаправкиГСМПоТопливнымКартам</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплатыОбразование</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccumulationRegister.ОтражениеЭДВУчете</xr:Item>
				<xr:Item>InformationRegister.ПараметрыСписанияДоходовБудущихПериодов</xr:Item>
				<xr:Item>InformationRegister.КазначейскоеОбеспечение</xr:Item>
				<xr:Item>AccumulationRegister.ИсторияКапвложений</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСНеоблагаемыеОперации</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПоказателиПланаПоПоступлениямВыбытиям</xr:Item>
				<xr:Item>AccumulationRegister.ДополнительныеЛистыКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ВходящийНДС</xr:Item>
				<xr:Item>InformationRegister.СведенияОСтудентах</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ИсполнениеОбязательствПоставщиками</xr:Item>
				<xr:Item>InformationRegister.РасчетАмортизацииОС</xr:Item>
				<xr:Item>InformationRegister.ПереоценкаНФА</xr:Item>
				<xr:Item>AccumulationRegister.ДополнительныеЛистыКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.НомераИнвентарныхКарточек</xr:Item>
				<xr:Item>AccumulationRegister.НаличиеДрагМатериаловВЛомеИОтходах</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплатыРодительскойПлаты</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизационнойПремииНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ЦенныеБумаги</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииПравПользованияОС</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
				<xr:Item>InformationRegister.ФиксированнаяБазаРаспределенияОбщихЗатрат</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>InformationRegister.СпособыРаспределенияНалогаПоИсточникамФинансирования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяДатаДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Comment>Реквизит, необходимый для выполнения правил конвертации</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровСведений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровНакопления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ЗаполнениеРегистровОС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Значение = Неопределено;
	
	Если Параметры.Свойство("Организация", Значение) И ЗначениеЗаполнено(Значение) Тогда
		Организация = Значение;
	Иначе
		Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
	КонецЕсли;
	
	Если Параметры.Свойство("Период", Значение) И ЗначениеЗаполнено(Значение) Тогда
		Период = Значение;
	Иначе
		Период = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Регистры", Значение) Тогда
		Для Каждого КлючЗначение Из Значение Цикл
			ЭтаФорма["Регистр" + КлючЗначение.Ключ] = (КлючЗначение.Значение <> Ложь);
		КонецЦикла;
	Иначе
		РегистрАмортизацияОбъектовОС				= Истина;
		РегистрСтоимостьОбъектовОС					= Истина;
		РегистрСтоимостьОбъектовОСПоКонтрагентам	= Истина;
		РегистрУчетныеДанныеОбъектаОС				= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДатыПоУмолчаниюКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ДокументыСведения.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДатыПоУмолчанию(Команда)
	
	ЗаполнитьДатыПоУмолчаниюКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатыПоУмолчаниюКлиент()
	
	ДатаСегодня = НачалоДня(Период);
	
	ДатыСведения.Очистить();
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДатаСвертки = ПолучитьДатуСверткиИлиВводаОстатков(Организация);
		Если ЗначениеЗаполнено(ДатаСвертки) И ДатаСвертки < ДатаСегодня Тогда
			ДатыСведения.Добавить(НачалоДня(ДатаСвертки));
		КонецЕсли;
	КонецЕсли;
	
	Если КонецДня(ДатаСегодня) <> КонецГода(ДатаСегодня) Тогда
		ДатаНачалаУчетногоПериода = НачалоДня(НачалоГода(Период) - 1);
		Если ДатыСведения.НайтиПоЗначению(ДатаНачалаУчетногоПериода) = Неопределено Тогда
			ДатыСведения.Добавить(ДатаНачалаУчетногоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Если ДатыСведения.НайтиПоЗначению(ДатаСегодня) = Неопределено Тогда
		ДатыСведения.Добавить(ДатаСегодня);
	КонецЕсли;
	
	ДатыСведения.СортироватьПоЗначению();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуСверткиИлиВводаОстатков(Организация)
	
	Возврат Документы.ВводНачальныхОстатковОС.ДатаВводаОстатков(Организация);
	
КонецФункции

&НаКлиенте
Процедура ДекорацияОткрытьКорректировкиНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Организация", Организация));
	ОткрытьФорму("Документ.КорректировкаРегистров.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыСведенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаСписка = ДокументыСведения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаСписка.Значение);
	
КонецПроцедуры

// Сведение сумм

&НаКлиенте
Процедура СвестиСуммыДвижений(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Организация не указана'"));
		Возврат;
	КонецЕсли;
	
	Если ДатыСведения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Даты сведения не указаны'"));
		Возврат;
	КонецЕсли;
	
	Флаги = Новый Структура;
	Флаги.Вставить("АмортизацияОбъектовОС"				, РегистрАмортизацияОбъектовОС);
	Флаги.Вставить("СтоимостьОбъектовОС"				, РегистрСтоимостьОбъектовОС);
	Флаги.Вставить("СтоимостьОбъектовОСПоКонтрагентам"	, РегистрСтоимостьОбъектовОСПоКонтрагентам);
	Флаги.Вставить("УчетныеДанныеОбъектаОС"				, РегистрУчетныеДанныеОбъектаОС);
	
	СписокДокументов = СвестиСуммыДвиженийСервер(Организация, ДатыСведения.ВыгрузитьЗначения(), Флаги);
	
	ДокументыСведения.ЗагрузитьЗначения(СписокДокументов);
	
	ТекстСообщения = ?(СписокДокументов.Количество() = 0,
		НСтр("ru = 'Расхождений сумм не обнаружено'"),
		НСтр("ru = 'Сведение сумм завершено!'"));
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвестиСуммыДвиженийСервер(Организация, СписокДат, Флаги)
	
	СписокДокументов = Новый Массив;
	
	Для Каждого ДатаСведения Из СписокДат Цикл
		Если ЗначениеЗаполнено(ДатаСведения) Тогда
			
			ДатаДвижений = КонецДня(ДатаСведения);
			Результат = Обработки.ЗаполнениеРегистровОС.Данные(Организация, ДатаДвижений, Флаги);
			
			Для Каждого ДанныеРегистра Из Результат Цикл
				СоздатьДокументКорректировки(ДанныеРегистра.Ключ, ДанныеРегистра.Значение,
					Организация, ДатаДвижений, СписокДокументов);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокументКорректировки(ИмяРегистра, Данные, Организация, ДатаДвижений, СписокДокументов)
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Док = Документы.КорректировкаРегистров.СоздатьДокумент();
	Док.Организация = Организация;
	Док.Дата = ДатаДвижений;
	Док.УстановитьНовыйНомер();
	Док.Комментарий = ИмяРегистра + " | документ создан автоматически | " + Формат(ТекущаяДата(), "ДЛФ=D");
	
	Если ИмяРегистра = "УчетныеДанныеОбъектаОС" Тогда
		Таблица = Док.ТаблицаРегистровСведений.Добавить();
	Иначе
		Таблица = Док.ТаблицаРегистровНакопления.Добавить();
	КонецЕсли;
	Таблица.Имя = ИмяРегистра;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док);
	
	Если ИмяРегистра = "УчетныеДанныеОбъектаОС" Тогда
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписей.Отбор.Регистратор.Установить(Док.Ссылка);
	
	Данные.Колонки.Добавить("Период");
	Данные.ЗаполнитьЗначения(ДатаДвижений, "Период");
	НаборЗаписей.Загрузить(Данные);
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
	СписокДокументов.Добавить(Док.Ссылка);
	
КонецПроцедуры

#КонецОбласти
